---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CorrectionFactor.GetTemperature
source: html/5d5653ab-6b66-fb08-ae26-5c7bba5102a8.htm
---
# Autodesk.Revit.DB.Electrical.CorrectionFactor.GetTemperature Method

Get temperature which is used for specifying correction factor. The value returned is quantified in
the document's selected unit of electrical temperature.

## Syntax (C#)
```csharp
public double GetTemperature()
```